#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-scripts relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/quarkiverse-devops/quarkiverse-devops/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/quarkiverse-devops/quarkiverse-devops

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-KQkd1c4k6M76dwMo

Waiting for the plan to start...

Terraform v1.12.1
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_repository.quarkus_amazon_services will be updated in-place
  ~ resource "github_repository" "quarkus_amazon_services" {
      - homepage_url                = "https://docs.quarkiverse.io/quarkus-amazon-services/dev/index.html" -> null
        id                          = "quarkus-amazon-services"
        name                        = "quarkus-amazon-services"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.quarkus_fury will be updated in-place
  ~ resource "github_repository" "quarkus_fury" {
      ~ full_name                   = "quarkiverse/quarkus-fury" -> (known after apply)
        id                          = "quarkus-fury"
      ~ name                        = "quarkus-fury" -> "quarkus-fory"
      ~ topics                      = [
          - "fury",
          + "fory",
            # (2 unchanged elements hidden)
        ]
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_team.quarkus_fury will be updated in-place
  ~ resource "github_team" "quarkus_fury" {
        id                        = "11425473"
      ~ name                      = "quarkiverse-fury" -> "quarkiverse-fory"
      ~ slug                      = "quarkiverse-fury" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # github_team_membership.quarkus_azure_services["m-reza-rahman"] will be created
  + resource "github_team_membership" "quarkus_azure_services" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "6620255"
      + username = "m-reza-rahman"
    }

  # github_team_membership.quarkus_discord4j["cottoncammy"] will be created
  + resource "github_team_membership" "quarkus_discord4j" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "6732488"
      + username = "cottoncammy"
    }

  # github_team_membership.quarkus_infinispan_embedded["ryanemerson"] will be created
  + resource "github_team_membership" "quarkus_infinispan_embedded" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "11211589"
      + username = "ryanemerson"
    }

  # github_team_repository.quarkus_fury must be replaced
-/+ resource "github_team_repository" "quarkus_fury" {
      ~ etag       = "W/"035e61819d43ff6a2c251eb3b01cb3c772f7e4c310b7624d68c0eb1c42edf21b"" -> (known after apply)
      ~ id         = "11425473:quarkus-fury" -> (known after apply)
      ~ repository = "quarkus-fury" -> "quarkus-fory" # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 3 to change, 1 to destroy.

```

*Pusher: @gastaldi, Action: `pull_request`, Workflow: `Terraform`*